export const directionList = [
    {
        title: 'Надання гуманітарної та медичної допомоги людям, які постраждали від війни',
        image: '1.jpeg'
    },
    {
        title: 'Відбудова напівзруйнованого житла в Гостомелі та Бучанському районі',
        image: '2.jpeg'
    },
    {
        title: 'Евакуація людей з гарячих точок України',
        image: '3.jpeg'
    },
    {
        title: 'Допомога ЗСУ та цивільним на сході',
        image: '4.jpeg'
    },
    {
        title: "Відновлення психологічного і ментального здоров'я людини",
        image: '5.jpeg'
    },
    {
        title: '',
        image: '6.jpeg'
    },
    {
        title: '',
        image: '7.jpeg'
    },
    {
        title: '',
        image: '8.jpeg'
    },
    {
        title: '',
        image: '9.jpeg'
    },
    {
        title: '',
        image: '10.jpeg'
    },
    {
        title: '',
        image: '11.jpeg'
    },
    {
        title: '',
        image: '12.jpeg'
    },
    {
        title: '',
        image: '13.jpeg'
    },
]


export const helpList = [
    {
        title: 'Військовим та їх рідним, які втратили роботу',
        image: '1.png'
    },
    {
        title: 'Людям, які потрапили в складні життєві обставини',
        image: '2.png'
    },
    {
        title: "Сім'ям, що втратили житло",
        image: '3.png'
    },
    {
        title: 'Людям, які потребують евакуації з гарячих точок країни',
        image: '4.png'
    },
    {
        title: 'Особам, які потребують психологічної підтримки',
        image: '5.png'
    },
    {
        title: 'Активістам, які хочуть розвивати громаду',
        image: '6.png'
    },
    {
        title: 'Покриваємо потреби волонтерів',
        image: '7.png'
    },
]